chore: using mermaid illustrate How It Works
